Конфигурация/AccumulationRegisters/РасходыПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыПоСделке</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ИсполнениеОбязательствПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсполнениеОбязательствПоСделке</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/CommonForms/СводнаяБиржеваяСделка/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьДокументы() Экспорт
	
	Документы = Новый Массив();
	
	Для каждого СтрокаЦенныеБумаги Из ЭтаФорма.ЦенныеБумаги Цикл
		Документы.Добавить(СтрокаЦенныеБумаги.Сделка);
	КонецЦикла;
	
	Возврат Документы;
	
КонецФункции // ПолучитьДокументы


&НаСервереБезКонтекста
Функция ПолучитьВариантыИсполнений(Сделки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Основание В(&Основание)";
		
	Запрос.УстановитьПараметр("Основание", Сделки);
	
	Возврат РаботаСЖурналамиОпераций.ПолучитьВариантыСводнойФормы(Запрос.Выполнить().Выбрать());
	
КонецФункции // ПолучитьВариантыИсполнений

&НаСервереБезКонтекста
Функция СформироватьКлючСводнойФормы(ПараметрыФормы)
	
	Возврат РаботаСЖурналамиОпераций.СформироватьКлючСводнойФормы("ОбщаяФорма.СводноеИсполнениеБиржевыхСделок", ПараметрыФормы);
	
КонецФункции // СформироватьКлючСводнойФормы


&НаСервере
Процедура ОбработатьДокументыНаСервере(РежимЗаписи, ПомечатьНаУдаление = Ложь)
	
	НачатьТранзакцию();
	
	Для каждого СтрокаСделки Из Этаформа.ЦенныеБумаги Цикл
		НовыйСтатус = ?(ПомечатьНаУдаление, 0, ?(РежимЗаписи = РежимЗаписиДокумента.Проведение, 1, ЭтаФорма.Состояние));
		
		ДокументОбъект = СтрокаСделки.Сделка.ПолучитьОбъект();
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("КорзинаЦенныхБумаг", Истина);
		ДокументОбъект.ДополнительныеСвойства.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
		
		Если ПомечатьНаУдаление Тогда
			Если ДокументОбъект.Проведен Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			ДокументОбъект.ПометкаУдаления = НЕ ДокументОбъект.ПометкаУдаления;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписи);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Процедура ИзменитьНомераПозицийНаСервере()
	
	Для НомСтр = 0 По ЭтаФорма.ЦенныеБумаги.Количество() - 1 Цикл
		ЭтаФорма.ЦенныеБумаги[НомСтр].НомерПозиции = (НомСтр + 1);
	КонецЦикла;
	
КонецПроцедуры // ИзменитьНомераПозицийНаСервере

&НаСервере
Процедура ОбновитьИтогНаСервере()
	
	ИзменитьНомераПозицийНаСервере();
	
	ИтогПокупкаСумма            = 0;
	ИтогПродажаСумма            = 0;
	ИтогПокупкаСуммаКупона      = 0;
	ИтогПродажаСуммаКупона      = 0;
	ИтогПокупкаТорговаяКомиссия = 0;
	ИтогПродажаТорговаяКомиссия = 0;
	ИтогПокупкаКомиссияБрокера  = 0;
	ИтогПродажаКомиссияБрокера  = 0;
	
	Для каждого СтрокаЦБ Из ЭтаФорма.ЦенныеБумаги Цикл
		Если СтрокаЦБ.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ИтогПокупкаСумма            = ИтогПокупкаСумма + СтрокаЦБ.Сумма;
			ИтогПокупкаСуммаКупона      = ИтогПокупкаСуммаКупона + СтрокаЦБ.СуммаКупона;
			ИтогПокупкаТорговаяКомиссия = ИтогПокупкаТорговаяКомиссия + СтрокаЦБ.ТорговаяКомиссия;
			ИтогПокупкаКомиссияБрокера  = ИтогПокупкаКомиссияБрокера + СтрокаЦБ.КомиссияБрокера;
		ИначеЕсли СтрокаЦБ.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ИтогПродажаСумма            = ИтогПродажаСумма + СтрокаЦБ.Сумма;
			ИтогПродажаСуммаКупона      = ИтогПродажаСуммаКупона + СтрокаЦБ.СуммаКупона;
			ИтогПродажаТорговаяКомиссия = ИтогПродажаТорговаяКомиссия + СтрокаЦБ.ТорговаяКомиссия;
			ИтогПродажаКомиссияБрокера  = ИтогПродажаКомиссияБрокера + СтрокаЦБ.КомиссияБрокера;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Итоги.Заголовок = 
		?(ИтогПокупкаСумма + ИтогПокупкаСуммаКупона + ИтогПокупкаТорговаяКомиссия + ИтогПокупкаКомиссияБрокера = 0, "",
			"Покупка: " + ИтогПокупкаСумма + ?(ЭтаФорма.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации, ", купон " + ИтогПокупкаСуммаКупона + ", итого " + (ИтогПокупкаСумма + ИтогПокупкаСуммаКупона), "")
				+ ", комиссия биржи " + ИтогПокупкаТорговаяКомиссия + ", комиссия брокера " + ИтогПокупкаКомиссияБрокера + Символы.ВК + Символы.ПС) + 
		?(ИтогПродажаСумма + ИтогПродажаСуммаКупона + ИтогПродажаТорговаяКомиссия + ИтогПродажаКомиссияБрокера = 0, "",
			"Продажа: " + ИтогПродажаСумма + ?(ЭтаФорма.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации, ", купон " + ИтогПродажаСуммаКупона + ", итого " + (ИтогПродажаСумма + ИтогПродажаСуммаКупона), "")
				+ ", комиссия биржи " + ИтогПродажаТорговаяКомиссия + ", комиссия брокера " + ИтогПродажаКомиссияБрокера);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере()

	РаботаСОтчетами.КонтрольМультивалютностиРасходовПоСделкам(ЭтаФорма.СчетДоверительногоУправления, НачалоДня(ЭтаФорма.Дата), КонецДня(ЭтаФорма.Дата)); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РасходыПоТорговойКомиссии.Сделка, РасходыПоБрокерскойКомиссии.Сделка) КАК Сделка,
		|	ЕСТЬNULL(РасходыПоТорговойКомиссии.ЦеннаяБумага, РасходыПоБрокерскойКомиссии.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаТорговойКомиссии,
		|	РасходыПоТорговойКомиссии.СуммаОборот КАК ТорговаяКомиссия,
		|	РасходыПоБрокерскойКомиссии.Валюта КАК ВалютаКомиссииБрокера,
		|	РасходыПоБрокерскойКомиссии.СуммаОборот КАК КомиссияБрокера
		|ПОМЕСТИТЬ ВТ_КомиссииПоСделке
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
		|			,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоТорговойКомиссии
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
		|				,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Рынок = &Рынок
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоБрокерскойКомиссии
		|		ПО РасходыПоТорговойКомиссии.Организация = РасходыПоБрокерскойКомиссии.Организация
		|			И РасходыПоТорговойКомиссии.СчетДоверительногоУправления = РасходыПоБрокерскойКомиссии.СчетДоверительногоУправления
		|			И РасходыПоТорговойКомиссии.Сделка = РасходыПоБрокерскойКомиссии.Сделка
		|			И РасходыПоТорговойКомиссии.Рынок = РасходыПоБрокерскойКомиссии.Рынок
		|			И РасходыПоТорговойКомиссии.ЦеннаяБумага = РасходыПоБрокерскойКомиссии.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК НомерПозиции,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.ЦенаПроцент КАК ЦенаПроцент,
		|	СделкаЦенныеБумаги.Сумма КАК Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупона,
		|	СделкаЦенныеБумаги.Ссылка КАК Сделка,
		|	СделкаЦенныеБумаги.Ссылка.РежимПереговорныхСделок КАК РежимПереговорныхСделок,
		|	СделкаЦенныеБумаги.Ссылка.ПервичноеРазмещение КАК ПервичноеРазмещение,
		|	СделкаЦенныеБумаги.Ссылка.ВидСделки КАК ВидСделки,
		|	СделкаЦенныеБумаги.Ссылка.НомерСделки КАК НомерСделки,
		|	СделкаЦенныеБумаги.Ссылка.ВремяСделки КАК ВремяСделки,
		|	СделкаЦенныеБумаги.Ссылка.КодРасчетовНаБирже КАК КодРасчетовНаБирже,
		|	ВТ_КомиссииПоСделке.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	ВТ_КомиссииПоСделке.КомиссияБрокера КАК КомиссияБрокера
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомиссииПоСделке КАК ВТ_КомиссииПоСделке
		|		ПО СделкаЦенныеБумаги.Ссылка = ВТ_КомиссииПоСделке.Сделка
		|			И СделкаЦенныеБумаги.ЦеннаяБумага = ВТ_КомиссииПоСделке.ЦеннаяБумага
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(СделкаЦенныеБумаги.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаЦенныеБумаги.Ссылка.Брокер = &Брокер
		|	И СделкаЦенныеБумаги.Ссылка.МестоХранения = &МестоХранения
		|	И СделкаЦенныеБумаги.Ссылка.Рынок = &Рынок
		|	И СделкаЦенныеБумаги.Ссылка.ПометкаУдаления = &ПометкаУдаления
		|	И СделкаЦенныеБумаги.Ссылка.Проведен = &Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСделки";
		
	Запрос.УстановитьПараметр("Дата",                         ЭтаФорма.Дата);	
	Запрос.УстановитьПараметр("Организация",                  ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("МестоХранения",                ЭтаФорма.МестоХранения);
	Запрос.УстановитьПараметр("Брокер",                       ЭтаФорма.Брокер);
	Запрос.УстановитьПараметр("Рынок",                        ЭтаФорма.Рынок);
	Запрос.УстановитьПараметр("ПометкаУдаления",              (ЭтаФорма.Состояние = Перечисления.СостоянияДокументов.ПомеченНаУдаление));
	Запрос.УстановитьПараметр("Проведен",                     (ЭтаФорма.Состояние = Перечисления.СостоянияДокументов.Проведен));

	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ЦенныеБумаги");

	ОбновитьИтогНаСервере();
	
КонецПроцедуры // ОбновитьФорму

&НаСервере
Функция СделкаПодходитНаСервере(ИзмененнаяСделка)

	Возврат (ЭтаФорма.МестоХранения = ИзмененнаяСделка.МестоХранения)
		И (ЭтаФорма.Брокер = ИзмененнаяСделка.Брокер)
		И (ЭтаФорма.Организация = ИзмененнаяСделка.Организация)
		И (ЭтаФорма.Рынок = ИзмененнаяСделка.Рынок)
		И (ЭтаФорма.СчетДоверительногоУправления = ИзмененнаяСделка.СчетДоверительногоУправления)
		И (НачалоДня(ЭтаФорма.Дата) = НачалоДня(ИзмененнаяСделка.Дата));

КонецФункции

&НаСервере
Процедура ОбновитьПоСделкеНаСервере(ИзмененнаяСделка)

	НужноОбновлять = Ложь;
	
	СтрокиСделок = ЭтаФорма.ЦенныеБумаги.НайтиСтроки(Новый Структура("Сделка", ИзмененнаяСделка));
	
	Если СтрокиСделок.Количество() = 0 Тогда // не было такой сделки у нас
		Если СделкаПодходитНаСервере(ИзмененнаяСделка) Тогда // надо добавить
			Для каждого СтрокаЦБ Из ИзмененнаяСделка.ЦенныеБумаги Цикл
				НоваяСтрока = Этаформа.ЦенныеБумаги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЦБ);
				
				НоваяСтрока.ПервичноеРазмещение     = ИзмененнаяСделка.ПервичноеРазмещение;
				НоваяСтрока.РежимПереговорныхСделок = ИзмененнаяСделка.РежимПереговорныхСделок;
				НоваяСтрока.ВремяСделки             = ИзмененнаяСделка.ВремяСделки;
				НоваяСтрока.НомерСделки             = ИзмененнаяСделка.НомерСделки;
				НоваяСтрока.КодРасчетовНаБирже      = ИзмененнаяСделка.КодРасчетовНаБирже;
				НоваяСтрока.ВидСделки               = ИзмененнаяСделка.ВидСделки;
				НоваяСтрока.Сделка                  = ИзмененнаяСделка;
			КонецЦикла;
		КонецЕсли;
		
	Иначе // была такая сделка у нас
		Если СделкаПодходитНаСервере(ИзмененнаяСделка) Тогда // обновим её
			Для каждого СтрокаЦБ Из ИзмененнаяСделка.ЦенныеБумаги Цикл
				Для каждого СтрокаСделок Из СтрокиСделок Цикл
					Если СтрокаСделок.ЦеннаяБумага <> СтрокаЦБ.ЦеннаяБумага Тогда
						Продолжить;
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(СтрокаСделок, СтрокаЦБ);
					
					СтрокаСделок.ПервичноеРазмещение     = ИзмененнаяСделка.ПервичноеРазмещение;
					СтрокаСделок.РежимПереговорныхСделок = ИзмененнаяСделка.РежимПереговорныхСделок;
					СтрокаСделок.ВремяСделки             = ИзмененнаяСделка.ВремяСделки;
					СтрокаСделок.НомерСделки             = ИзмененнаяСделка.НомерСделки;
					СтрокаСделок.КодРасчетовНаБирже      = ИзмененнаяСделка.КодРасчетовНаБирже;
					СтрокаСделок.ВидСделки               = ИзмененнаяСделка.ВидСделки;
					СтрокаСделок.Сделка                  = ИзмененнаяСделка;
				КонецЦикла;
			КонецЦикла;
		Иначе // была, да сплыла
			Для каждого СтрокаСделок Из СтрокиСделок Цикл
				ЭтаФорма.ЦенныеБумаги.Удалить(СтрокаСделок);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИтогНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Дата                         = ЭтаФорма.Параметры.Дата;
	ЭтаФорма.Организация                  = ЭтаФорма.Параметры.Организация;
	ЭтаФорма.СчетДоверительногоУправления = ЭтаФорма.Параметры.СчетДоверительногоУправления;
	ЭтаФорма.МестоХранения                = ЭтаФорма.Параметры.МестоХранения;
	ЭтаФорма.Брокер                       = ЭтаФорма.Параметры.Брокер;
	ЭтаФорма.Рынок                        = ЭтаФорма.Параметры.Рынок;
	ЭтаФорма.Состояние                    = ЭтаФорма.Параметры.Состояние;
	
	ЭтаФорма.Заголовок = "Сводная биржевая сделка от " + Формат(ЭтаФорма.Дата) + " (" + НРег(ЭтаФорма.Состояние) + ")";
	
	Если Не ЗначениеЗаполнено(Этаформа.Организация) Тогда
		Этаформа.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	Если ЭтаФорма.Рынок <> Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		ЭтаФорма.Элементы.ЦенныеБумагиЦенаПроцент.Видимость = Ложь;
		ЭтаФорма.Элементы.ЦенныеБумагиСуммаКупона.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ОписаниеОтбора.Заголовок = Формат(ЭтаФорма.Дата, "ДФ=dd.MM.yyyy") + ", "
		+ ЭтаФорма.СчетДоверительногоУправления + ", " + ЭтаФорма.Рынок + ", " + ЭтаФорма.МестоХранения + ", " + ЭтаФорма.Брокер + ".";
	
	ОбновитьФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СводнаяБиржеваяСделка.Обновить" Тогда
		ОбновитьПоСделкеНаСервере(Параметр)
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦенныеБумагиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("Документ.Сделка.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Сделка));
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	Если НЕ Копирование Тогда
	    ОткрытьФормуМодально("Документ.Сделка.ФормаОбъекта", 
			Новый Структура("ЗначенияЗаполнения", 
			Новый Структура("Дата,МестоХранения,Брокер,СчетДоверительногоУправления,Рынок,Организация", 
				Этаформа.Дата,
				Этаформа.МестоХранения,
				Этаформа.Брокер,
				Этаформа.СчетДоверительногоУправления,
				Этаформа.Рынок,
				Этаформа.Организация)));
	Иначе
		ОткрытьФормуМодально("Документ.Сделка.ФормаОбъекта", Новый Структура("ЗначениеКопирования", Элемент.ТекущиеДанные.Сделка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаПровестиИЗакрыть(Команда)
	
	ОбработатьДокументыНаСервере(РежимЗаписиДокумента.Проведение);
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	ОбработатьДокументыНаСервере(РежимЗаписиДокумента.Запись);
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровести(Команда)
	
	ОбработатьДокументыНаСервере(РежимЗаписиДокумента.Проведение);
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПометитьНаУдаление(Команда)
	
	Если ЭтаФорма.Состояние = 0 Тогда //Удален
		Если Вопрос("Подтвердите отмену удаления объекта!", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ЭтаФорма.Состояние = 2;
	Иначе
		Если Вопрос("Объект будет помечен на удаление!", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ЭтаФорма.Состояние = 0;
	КонецЕсли;
	ОбработатьДокументыНаСервере(РежимЗаписиДокумента.Запись, Истина);
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменаПроведения(Команда)
	
	ОбработатьДокументыНаСервере(РежимЗаписиДокумента.ОтменаПроведения);
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречитать(Команда)
	
	ОбновитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиКСводномуИсполнению(Команда)
	
	Сделки = Новый Массив();
	
	Для каждого СтрокаЦенныеБумаги Из ЭтаФорма.ЦенныеБумаги Цикл
		Сделки.Добавить(СтрокаЦенныеБумаги.Сделка);
	КонецЦикла;
	
	ВариантыИсполнений = ПолучитьВариантыИсполнений(Сделки);
	
	РеквизитыСводнойФормыИсполнения = Неопределено;
	
	Если      ВариантыИсполнений.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данным сделкам исполнения отсутствуют.");
		Возврат;
		
	ИначеЕсли ВариантыИсполнений.Количество() = 1 Тогда
		РеквизитыСводнойФормыИсполнения = ВариантыИсполнений[0];
		
	Иначе
		РеквизитыСводнойФормыИсполнения = ОткрытьФормуМодально("Обработка.ЖурналыОпераций.Форма.ВыборВариантаСводнойФормыИсполненияСделки",
			Новый Структура("ВариантыСводнойФормы, НеОтображатьПоля, Заголовок", ВариантыИсполнений, "ЦеннаяБумага, Документ, ВидДокумента", "Выбор варианта исполнения сводной биржевой сделки"),
			ЭтаФорма);
			
		Если РеквизитыСводнойФормыИсполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.СводноеИсполнениеБиржевыхСделок", РеквизитыСводнойФормыИсполнения, ЭтаФорма, СформироватьКлючСводнойФормы(РеквизитыСводнойФормыИсполнения));
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроводкиДокумента(Команда)
	
	ТекущиеДанные = ЭтаФорма.Элементы.ЦенныеБумаги.ТекущиеДанные;
		
	Если ТекущиеДанные <> Неопределено Тогда
		
		ОткрытьФорму("ОбщаяФорма.ПроводкиДокумента", 
			Новый Структура("Регистратор", ТекущиеДанные.Сделка), 
			ЭтаФорма, 
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры
